# 1. Introduction

In [1]:
import pandas as pd

In [2]:
ser = pd.Series(
    [100,'foo',300,'bar',500],
    ['tom','bob','nancy','dan','eric']
)
print(ser)

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

ser.index

In [3]:
ser.loc[['nancy','bob']]

nancy    300
bob      foo
dtype: object

In [4]:
ser[[4,3,1]]

eric    500
dan     bar
bob     foo
dtype: object

In [5]:
ser.iloc[2]

300

In [6]:
'bob' in ser

True

In [7]:
print(ser)
print(ser*2)

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object
tom         200
bob      foofoo
nancy       600
dan      barbar
eric       1000
dtype: object

In [8]:
ser[['nancy','eric']]**2

nancy     90000
eric     250000
dtype: object

# 2. Create DataFrame from Dictionary of Python Series

In [9]:
d = {
        'one' : pd.Series([100.,200.,300.],
                         index=['apple','ball','clock']),
        'two' : pd.Series([111.,222.,333.,4444.],
                         index=['apple','ball','cerill','dancy'])
    }
df = pd.DataFrame(d)

In [10]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

## 2.1 Other Way to Do the Same

In [11]:
d = {
    'one':[100.,200.,float("NaN"),300.,float("NaN")],
    'two':[111.,222.,333.,float("NaN"),4444.],
    "temp_index":['apple','ball','cerill','clock','dancy']
}
df = pd.DataFrame(data=d)
df.set_index("temp_index",inplace=True)
df.index.name=None
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [12]:
d = {
    'one':pd.Series([100.,200.,300.],index=['apple','ball','clock']),
    'two':pd.Series([111.,222.,333.,4444.],index=['apple','ball','cerill','dancy'])
}
df = pd.DataFrame(d)
pd.DataFrame(d,index=['dancy','ball','apple'])

         one     two
dancy    NaN  4444.0
ball   200.0   222.0
apple  100.0   111.0

In [13]:
pd.DataFrame(d,index=['dancy','ball','apple'],columns=['two','five'])

          two five
dancy  4444.0  NaN
ball    222.0  NaN
apple   111.0  NaN

# 3. Create DataFrame from List of Python Dictionaries

In [14]:
data = [
    {'alex':1, 'joe':2},
    {'ema':5, 'dora':10, 'alice':20}
]

In [15]:
pd.DataFrame(data)

   alex  joe  ema  dora  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

In [16]:
pd.DataFrame(data, index=['orange','red'])

        alex  joe  ema  dora  alice
orange   1.0  2.0  NaN   NaN    NaN
red      NaN  NaN  5.0  10.0   20.0

In [17]:
pd.DataFrame(data, columns=['joe','dora','alice'])

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0

# 4. Basic DataFrame Operations

In [18]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [19]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [20]:
df['three'] = df['one'] * df['two']
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dancy     NaN  4444.0      NaN

In [21]:
df['flag'] = df['one'] > 250
df

          one     two    three   flag
apple   100.0   111.0  11100.0  False
ball    200.0   222.0  44400.0  False
cerill    NaN   333.0      NaN  False
clock   300.0     NaN      NaN   True
dancy     NaN  4444.0      NaN  False

In [22]:
three = df.pop('three')

In [23]:
three

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dancy         NaN
Name: three, dtype: float64

In [24]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

In [25]:
del df['two']

In [26]:
df

          one   flag
apple   100.0  False
ball    200.0  False
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

In [27]:
df.insert(2, 'copy_of_one', df['one'])
df

          one   flag  copy_of_one
apple   100.0  False        100.0
ball    200.0  False        200.0
cerill    NaN  False          NaN
clock   300.0   True        300.0
dancy     NaN  False          NaN

In [28]:
df['one_upper_half'] = df['one'][:2]
df

          one   flag  copy_of_one  one_upper_half
apple   100.0  False        100.0           100.0
ball    200.0  False        200.0           200.0
cerill    NaN  False          NaN             NaN
clock   300.0   True        300.0             NaN
dancy     NaN  False          NaN             NaN

In [29]:
df.dropna(axis=0,thresh=2)

         one   flag  copy_of_one  one_upper_half
apple  100.0  False        100.0           100.0
ball   200.0  False        200.0           200.0
clock  300.0   True        300.0             NaN